<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"6a57e1adc6315304705f12e5ecefa5a6d671f880b70f7fce805510b644e4bbdc","plan_job_ref":"Job Plan Airflow DAGs #419 at https://github.com/cal-itp/data-infra/actions/runs/16661742200","plan_out_hash":"77b1af0ec859eedb9fb6a19cec565374be17f1feb5e43e56661915a9805356e7","plan_hash":"3a62a26dec180f14dc3d5a7b2b86c60a4ed1d2212758b52b4b292b2389064ecf","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "U/4sSA==" -> (known after apply)
!~      detect_md5hash      = "4ziLxilkQ9JcxY4Vrt+5eg==" -> "different hash"
!~      generation          = 1753499815609920 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "4ziLxilkQ9JcxY4Vrt+5eg==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/gtfs/fct_trip_updates_summaries.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "84OnIQ==" -> (known after apply)
!~      detect_md5hash      = "kAEmHBZSBj1BFL66yCVYXg==" -> "different hash"
!~      generation          = 1751416665776670 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/mart/gtfs/fct_trip_updates_summaries.sql"
!~      md5hash             = "kAEmHBZSBj1BFL66yCVYXg==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs/fct_trip_updates_summaries.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "ydMl0A==" -> (known after apply)
!~      detect_md5hash      = "KRfewilBTB59eAVjAUV27A==" -> "different hash"
!~      generation          = 1753499817227203 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "KRfewilBTB59eAVjAUV27A==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #419](https://github.com/cal-itp/data-infra/actions/runs/16661742200)